tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "messense/macos-cross-toolchains"
tap "nikitabobko/tap"
tap "playcover/playcover"
brew "adb-enhanced"
brew "awscli"
brew "blueutil"
brew "btop"
brew "curl", args: ["HEAD"]
brew "dive"
brew "djvulibre"
brew "duf"
brew "exiftool"
brew "feroxbuster"
brew "ffuf"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "graphviz"
brew "grep"
brew "gstreamer"
brew "helix"
brew "ifstat"
brew "iproute2mac"
brew "jadx"
brew "jython"
brew "kubernetes-cli"
brew "libomp"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "mas"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "nowplaying-cli"
brew "php"
brew "qemu"
brew "rclone"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "shfmt"
brew "socat"
brew "sqlmap"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "typescript-language-server"
brew "watch"
brew "wget"
brew "yarn"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
cask "chromium"
cask "cyberduck"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "google-chrome"
cask "google-cloud-sdk"
cask "jordanbaird-ice"
cask "logi-options+"
cask "melonds"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "ngrok"
cask "playcover-community"
cask "sf-symbols"
cask "shortcat"
cask "steam"
cask "vlc"
cask "wireshark"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Goodnotes", id: 1444383602
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Tailscale", id: 1475387142
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "aykutsarac.jsoncrack-vscode"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "fill-labs.dependi"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkhl.shfmt"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nstechbytes.html-view"
vscode "openai.openai-chatgpt-adhoc"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "wscats.cors-browser"
vscode "xabikos.javascriptsnippets"
vscode "zoellner.openapi-preview"
